In [2]:
import pandas as pd
import numpy as np

In [3]:
data_lst = [
    {'yyyy-mm-dd' : '1996-06-26', 'city' : 'seoul'},
    {'yyyy-mm-dd' : '2000-12-26', 'city' : 'Daejeon'},
    {'yyyy-mm-dd' : '1989-01-06', 'city' : 'boocheon'}
]

In [17]:
df = pd.DataFrame(data_lst, columns=['yyyy-mm-dd','city'])
df

   yyyy-mm-dd      city
0  1996-06-26     seoul
1  2000-12-26   Daejeon
2  1989-01-06  boocheon

In [18]:
df['year'] = df['yyyy-mm-dd'].apply(lambda row: row.split('-')[0])
df

   yyyy-mm-dd      city  year
0  1996-06-26     seoul  1996
1  2000-12-26   Daejeon  2000
2  1989-01-06  boocheon  1989

In [21]:
df['age'] = df['year'].apply(lambda row: 2020 - int(row))
df

   yyyy-mm-dd      city  year  age  age1
0  1996-06-26     seoul  1996   24    24
1  2000-12-26   Daejeon  2000   20    20
2  1989-01-06  boocheon  1989   31    31

In [31]:
# df.drop(columns='age1', axis=0, inplace=True)
df

   yyyy-mm-dd      city  year  age
0  1996-06-26     seoul  1996   24
1  2000-12-26   Daejeon  2000   20
2  1989-01-06  boocheon  1989   31

In [32]:
df.rename(columns={'yyyy-mm-dd' : '생년월일'},)

         생년월일      city  year  age
0  1996-06-26     seoul  1996   24
1  2000-12-26   Daejeon  2000   20
2  1989-01-06  boocheon  1989   31

In [33]:
'seoul' in df

False

In [34]:
for i in df:
    print(i)

yyyy-mm-dd
city
year
age

In [44]:
'seoul' in df.city.values

True

In [52]:
df[df.city=='Daejeon']

   yyyy-mm-dd     city  year  age
1  2000-12-26  Daejeon  2000   20

In [59]:
def make_intro(row):
    return f'I was born in {row.year} at {row.city}. My age is {row.age}.'

In [60]:
df['Introduction'] = df.apply(make_intro, axis=1)
df

,yyyy-mm-dd,city,year,age,Introduction
0,1996-06-26,seoul,1996,24,I was born in 1996 at seoul. My age is 24.
1,2000-12-26,Daejeon,2000,20,I was born in 2000 at Daejeon. My age is 20.
2,1989-01-06,boocheon,1989,31,I was born in 1989 at boocheon. My age is 31.

In [62]:
df['Introduction1'] = df.apply(lambda row: f'I was born in {row.year}\
    at {row.city}. My age is {row.age}.', axis=1)
df

,yyyy-mm-dd,city,year,age,Introduction,Introduction1
0,1996-06-26,seoul,1996,24,I was born in 1996 at seoul. My age is 24.,I was born in 1996 at seoul. My age is 24.
1,2000-12-26,Daejeon,2000,20,I was born in 2000 at Daejeon. My age is 20.,I was born in 2000 at Daejeon. My age is 20.
2,1989-01-06,boocheon,1989,31,I was born in 1989 at boocheon. My age is 31.,I was born in 1989 at boocheon. My age is 31.

In [75]:
df.iloc[[0,1,2],[1, 2,4]]

       city  year                                   Introduction
0     seoul  1996     I was born in 1996 at seoul. My age is 24.
1   Daejeon  2000   I was born in 2000 at Daejeon. My age is 20.
2  boocheon  1989  I was born in 1989 at boocheon. My age is 31.

In [66]:
df

,yyyy-mm-dd,city,year,age,Introduction,Introduction1
0,1996-06-26,seoul,1996,24,I was born in 1996 at seoul. My age is 24.,I was born in 1996 at seoul. My age is 24.
1,2000-12-26,Daejeon,2000,20,I was born in 2000 at Daejeon. My age is 20.,I was born in 2000 at Daejeon. My age is 20.
2,1989-01-06,boocheon,1989,31,I was born in 1989 at boocheon. My age is 31.,I was born in 1989 at boocheon. My age is 31.